/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Δεν ήταν δυνατή η ολοκλήρωση της λειτουργίας";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Προέκυψε άγνωστο σφάλμα (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Δεν είναι δυνατή η ολοκλήρωση ενέργειας";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Δοκιμάστε ξανά αργότερα.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Δεν είναι δυνατή η εγγραφή";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Δοκιμάστε ξανά την εγγραφή.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Δεν είναι δυνατή η εγγραφή";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Σταματήστε τυχόν άλλες ενέργειες που χρησιμοποιούν τη συσκευή (%@) και δοκιμάστε ξανά."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Δεν είναι δυνατή η εγγραφή";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Δοκιμάστε ξανά την εγγραφή.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Η εγγραφή σταμάτησε";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Δοκιμάστε ξανά την εγγραφή.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Η λειτουργία διακόπηκε";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Δεν υπάρχει αρκετός διαθέσιμος χώρος για να συνεχίσετε την εγγραφή αρχείων. Διαγράψτε υπάρχοντα βίντεο ή φωτογραφίες για να δημιουργήσετε χώρο.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Η εγγραφή σταμάτησε";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Δοκιμάστε ξανά την εγγραφή.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Η εγγραφή σταμάτησε";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Δοκιμάστε ξανά την εγγραφή.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Η εγγραφή σταμάτησε";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Έχει επιτευχθεί η μέγιστη διάρκεια για αυτή την εγγραφή."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Η εγγραφή σταμάτησε";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Έχει επιτευχθεί το μέγιστο μέγεθος για αυτή την εγγραφή."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Η εγγραφή σταμάτησε";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Σταματήστε τυχόν άλλες ενέργειες που χρησιμοποιούν τη συσκευή εγγραφής και δοκιμάστε ξανά.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Η εγγραφή σταμάτησε";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Έχει επιτευχθεί η μέγιστη διάρκεια για αυτή την εγγραφή."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Δεν είναι δυνατή η εγγραφή";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Δοκιμάστε ξανά την εγγραφή.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Δεν είναι δυνατή η χρήση %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Σταματήστε τυχόν άλλες ενέργειες που χρησιμοποιούν τη συσκευή (%@) και δοκιμάστε ξανά."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Δεν είναι δυνατή η χρήση %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Σταματήστε τυχόν άλλες ενέργειες που χρησιμοποιούν τη συσκευή (%@) και δοκιμάστε ξανά."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Η εγγραφή σταμάτησε";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Σταματήστε τυχόν άλλες ενέργειες που χρησιμοποιούν τη συσκευή εγγραφής και δοκιμάστε ξανά.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Δεν είναι δυνατή η ολοκλήρωση ενέργειας";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Δοκιμάστε ξανά αργότερα.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Δεν είναι δυνατή η ολοκλήρωση εξαγωγής";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Δοκιμάστε ξανά την εξαγωγή.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Δεν είναι δυνατή η αποκωδικοποίηση";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Δεν ήταν δυνατή η αποκωδικοποίηση δεδομένων μέσων. Ίσως είναι κατεστραμμένα.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Δεν είναι δυνατό το άνοιγμα";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Αυτή η μορφή μέσου δεν υποστηρίζεται.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Δεν είναι δυνατή η αποθήκευση";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Δοκιμάστε ξανά την αποθήκευση.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Δεν είναι δυνατό το άνοιγμα";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Αυτό το μέσο δεν είναι δυνατό να χρησιμοποιηθεί.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Δεν είναι δυνατό το άνοιγμα";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Αυτό το μέσο δεν είναι δυνατό να χρησιμοποιηθεί.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Δεν είναι δυνατό το άνοιγμα";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Αυτό το μέσο δεν είναι δυνατό να χρησιμοποιηθεί.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Δεν είναι δυνατό το άνοιγμα";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Αυτό το μέσο δεν είναι δυνατό να χρησιμοποιηθεί.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Δεν είναι δυνατό το άνοιγμα";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Αυτή η μορφή μέσου δεν υποστηρίζεται.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Δεν είναι δυνατό το άνοιγμα";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Αυτό το μέσο ίσως είναι κατεστραμμένο.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Δεν είναι δυνατή η λήψη φωτογραφίας";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Δοκιμάστε ξανά τη λήψη φωτογραφίας.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Η λειτουργία διακόπηκε";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Η λειτουργία δεν υποστηρίζεται για προστατευμένο περιεχόμενο."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Δεν είναι δυνατό το άνοιγμα";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Αυτό το περιεχόμενο δεν έχει εξουσιοδότηση."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Δεν είναι δυνατό το άνοιγμα";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Αυτή η εφαρμογή δεν έχει εξουσιοδότηση να αναπαράγει αυτό το αρχείο."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Δεν είναι δυνατό το άνοιγμα";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Αυτό το μέσο δεν είναι δυνατό να χρησιμοποιηθεί.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Δεν είναι δυνατή η αποκωδικοποίηση";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Ο αποκωδικοποιητής που απαιτείται για αυτό το μέσο δεν βρέθηκε.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Δεν είναι δυνατή η κωδικοποίηση";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Ο κωδικοποιητής που απαιτείται για αυτό το μέσο δεν βρέθηκε.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Δεν είναι δυνατή η αποκωδικοποίηση";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Ο αποκωδικοποιητής που απαιτείται για αυτό το πολυμέσο είναι απασχολημένος.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Σταματήστε τυχόν άλλες ενέργειες που αποκωδικοποιούν πολυμέσα και δοκιμάστε ξανά.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Δεν είναι δυνατή η κωδικοποίηση";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Ο κωδικοποιητής που απαιτείται για αυτό το πολυμέσο είναι απασχολημένος.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Σταματήστε τυχόν άλλες ενέργειες που κωδικοποιούν πολυμέσα και δοκιμάστε ξανά.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Δεν είναι δυνατή η χρήση %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "Δεν είναι δυνατό να χρησιμοποιηθεί η συσκευή (%@) από εφαρμογή που λειτουργεί στο υπόβαθρο."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Η λειτουργία διακόπηκε";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Η λειτουργία δεν υποστηρίζεται για αυτό το μέσο.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Η λειτουργία διακόπηκε";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Δεν ήταν δυνατή η σύνθεση του βίντεο σύμφωνα με τις παρεχόμενες οδηγίες.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Δεν είναι δυνατό το άνοιγμα";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Αυτό το μέσο δεν είναι δυνατό να χρησιμοποιηθεί.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Η λειτουργία διακόπηκε";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Δεν είναι δυνατή η χρήση του αρχείου cache στο URL προορισμού λήψης.";
